   
# Advanced Dataframes

### Exercises I

### 1.Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
### 2.cd into your exercises folder for this module and run echo env.py >> .gitignore
### 3.Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.
### 4.Use your function to obtain a connection to the employees database.

In [46]:
import pandas as pd
import numpy as np
from pydataset import data
import matplotlib.pyplot as plt
import env

In [2]:
def get_db_url(db, username=env.user, host=env.host, password=env.password):
    return f'mysql+pymysql://{username}:{password}@{host}/{db}'

    
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'
query = 'select * from employees limit 5'

In [4]:
my_url =\
env.get_db_url(
env.user,
env.host,
env.password,
'employees')

In [5]:

pd.read_sql('select * from employees limit 5;', my_url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [11]:
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'
query = 'select * from employees limit 5'

In [ ]:
df = pd.read_sql(query, url)
df

In [14]:
pd.read_sql('''
        select * 
        from employees
        limit 3
        ''', url
        )

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28

In [15]:
#query
query = '''
select emp_no, first_name, last_name, dept_name
from employees
    join dept_emp
        using (emp_no)
    join departments
        using (dept_no)
where gender = 'F'
limit 10
;
'''
query

"\nselect emp_no, first_name, last_name, dept_name\nfrom employees\n    join dept_emp\n        using (emp_no)\n    join departments\n        using (dept_no)\nwhere gender = 'F'\nlimit 10\n;\n"

In [16]:
#connect to sql and pull query into df
pd.read_sql(query, url)

   emp_no first_name  last_name           dept_name
0   10002    Bezalel     Simmel               Sales
1   10006     Anneke    Preusig         Development
2   10007    Tzvetan  Zielinski            Research
3   10009     Sumant       Peac  Quality Management
4   10010  Duangkaew   Piveteau          Production
5   10010  Duangkaew   Piveteau  Quality Management
6   10011       Mary      Sluis    Customer Service
7   10017  Cristinel  Bouloucos           Marketing
8   10018   Kazuhide       Peha          Production
9   10018   Kazuhide       Peha         Development

### 5 .Once you have successfully run a query:

### a. Intentionally make a typo in the database url. What kind of error message do you see?

In [25]:
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employes' # edited employees to employes
query = 'select * from employees limit 5'

In [27]:
df = pd.read_sql(query, url)
df

OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'robinson_2287'@'%' to database 'employes'")
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
# OperationalError: (pymysql.err.OperationalError) (1044,
#"Access denied for user 'robinson_2287'@'%' to database 'employes'")

#### 5.b Intentionally make an error in your SQL query. What does the error message look like?

In [28]:
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees' 
query = 'select * from employees  5'    # edited and made an error in the select query

In [29]:
df = pd.read_sql(query, url)
df

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '5' at line 1")
[SQL: select * from employees  5]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
# getting ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; 
# check the manual that corresponds to your MySQL server version for the right syntax to use near '5' at line 1")
# [SQL: select * from employees  5]

#### 6. Read the employees and titles tables into two separate DataFrames.

In [30]:
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'
query = 'select * from employees limit 5'

In [31]:
df = pd.read_sql(query, url)
df

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [32]:
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'
query = 'select * from titles limit 5;'

In [33]:
df_titles = pd.read_sql(query, url)
df_titles

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

### 7.How many rows and columns do you have in each DataFrame? Is that what you expected?

In [6]:
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'
query = 'select * from employees '

In [7]:
pd.read_sql('''
        select * 
        from employees;
    
        ''', url
        )

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [8]:
df_employees = pd.read_sql(query, url)
df_employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [9]:
rows, columns = df_employees.shape
print(f"The DataFrame has {rows} rows and {columns} columns.")

The DataFrame has 300024 rows and 6 columns.

In [ ]:
#result is as expected

In [10]:
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'
query = 'select * from titles'

In [11]:
df_titles = pd.read_sql(query, url)
df_titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [12]:
rows, columns = df_titles.shape
print(f"The DataFrame has {rows} rows and {columns} columns.")

The DataFrame has 443308 rows and 4 columns.

In [ ]:
# result is as expected

### 8. Display the summary statistics for each DataFrame.

In [18]:
# For DataFrame of employees
df_summary_stats = df_employees.describe()
print("Summary statistics for DataFrame of employees:")
print(df_summary_stats)

Summary statistics for DataFrame of employees:
              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [19]:
# For DataFrame of titles
df_titles_summary_stats = df_titles.describe()
print("Summary statistics for DataFrame of titles:")
print(df_titles_summary_stats)

Summary statistics for DataFrame of titles:
              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

### 9.How many unique titles are in the titles DataFrame?

In [23]:
df_titles.nunique()

emp_no       300024
title             7
from_date      6393
to_date        5888
dtype: int64

In [24]:
unique_titles_count = df_titles['title'].nunique()
print("Number of unique titles:", unique_titles_count)

Number of unique titles: 7

### 10. What is the oldest date in the to_date column?

In [28]:
df_titles.to_date.min()

datetime.date(1985, 3, 1)

In [26]:
#or
oldest_date = df_titles['to_date'].min()

In [27]:
print("Oldest date in to_date column:", oldest_date)

Oldest date in to_date column: 1985-03-01

### 11.What is the most recent date in the to_date column?

In [31]:

most_recent_date = df_titles['to_date'].max()
print("Most recent date in to_date column:", most_recent_date)

Most recent date in to_date column: 9999-01-01

In [40]:
# getting the non-current records (no longer valid or applicable)
titles_non_current = pd.read_sql(
    'SELECT * FROM titles WHERE to_date < NOW()', url)
titles_non_current

        emp_no               title   from_date     to_date
0        10004            Engineer  1986-12-01  1995-12-01
1        10005               Staff  1989-09-12  1996-09-12
2        10007               Staff  1989-02-10  1996-02-11
3        10008  Assistant Engineer  1998-03-11  2000-07-31
4        10009  Assistant Engineer  1985-02-18  1990-02-18
...        ...                 ...         ...         ...
203179  499992               Staff  1987-05-10  1992-05-09
203180  499994            Engineer  1993-02-22  1993-10-27
203181  499996            Engineer  1996-05-13  2002-05-13
203182  499997            Engineer  1987-08-30  1992-08-29
203183  499998               Staff  1993-12-27  1998-12-27

[203184 rows x 4 columns]

In [39]:
# the latest date among the non-current records  
titles_non_current['to_date'].max()

datetime.date(2002, 8, 1)

# Exercises II

#### 1.Copy the users and roles DataFrames from the examples above.

In [41]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [42]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

##### 2.What is the result of using a right join on the DataFrames?

### A right join will include all rows from the roles dataframe and only the matching rows from the users dataframe based on the role_id. Non-matching rows from the users dataframe will be excluded.

In [43]:
rgt_join = pd.merge(users, 
                    roles, 
                    left_on='role_id', 
                    right_on='id', 
                    how='right').drop(columns='role_id')
rgt_join

   id_x name_x  id_y     name_y
0   1.0    bob     1      admin
1   2.0    joe     2     author
2   3.0  sally     3   reviewer
3   4.0   adam     3   reviewer
4   NaN    NaN     4  commenter

In [44]:
#or
users.merge(roles, left_on='role_id', right_on='id', how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [45]:
#or
#right joining and renaming the columns after the join

right_join = pd.merge(users, 
                    roles, 
                    left_on='role_id', 
                    right_on='id', 
                    how='right').drop(columns='role_id').rename(columns={'id_x': 'id', 
                                                                         'name_x': 'employee',
                                                                         'id_y': 'role_id',
                                                                         'name_y': 'role'}
                                                                )
right_join

    id employee  role_id       role
0  1.0      bob        1      admin
1  2.0      joe        2     author
2  3.0    sally        3   reviewer
3  4.0     adam        3   reviewer
4  NaN      NaN        4  commenter

#### 3.What is the result of using an outer join on the DataFrames?

### An outer join will include all rows from both the users and roles dataframes. If there is no match based on the role_id, the corresponding cells will contain NaN.

In [47]:
outer_join = pd.merge(users, 
         roles, 
         left_on='role_id', 
         right_on='id', 
         how='outer').drop(columns='role_id').rename(columns={'id_x': 'id', 
                                                            'name_x': 'employee',
                                                            'id_y': 'role_id',
                                                            'name_y': 'role'}
                                                    )
outer_join

    id employee  role_id       role
0  1.0      bob      1.0      admin
1  2.0      joe      2.0     author
2  3.0    sally      3.0   reviewer
3  4.0     adam      3.0   reviewer
4  5.0     jane      NaN        NaN
5  6.0     mike      NaN        NaN
6  NaN      NaN      4.0  commenter

In [50]:
#or

users.merge(roles, left_on='role_id', right_on='id', how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

### If you drop the foreign key, i.e role_id column from the users dataframe and then try to merge it with the roles dataframe, it it may not produce any meaningful result.

In [56]:
# Drop the 'role_id' column from the 'users' DataFrame
users_drop = users.drop(columns='role_id')
users_drop

   id   name
0   1    bob
1   2    joe
2   3  sally
3   4   adam
4   5   jane
5   6   mike

In [55]:


# Perform the merge after foreign key drop
merge_after_fkdrop = users_drop.merge(roles, how='inner')
print(merge_after_fkdrop)

Empty DataFrame
Columns: [id, name]
Index: []

### 5.Load the mpg dataset from PyDataset.

In [57]:
from pydataset import data

# Load the 'mpg' dataset
mpg = data('mpg')

mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

### 6. Output and read the documentation for the mpg dataset.

In [58]:
#To output and read the documentation for the 'mpg' dataset using the PyDataset library 


from pydataset import data

# Output the documentation to the console
print(data('mpg', show_doc=True))

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.


None

#### 7. How many rows and columns are in the dataset?

In [60]:
num_rows, num_columns = mpg.shape
print("Number of rows:", num_rows)
print("Number of columns:", num_columns)

Number of rows: 234
Number of columns: 11

#### 8. Check out your column names and perform any cleanup you may want on them.

In [63]:
#check out the column names
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

#### You can clean up the column names in the 'mpg' dataset by converting them to lowercase and replacing spaces with underscores.

In [62]:
mpg.columns = mpg.columns.str.lower().str.replace(' ', '_')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

#### 9.Display the summary statistics for the dataset.

In [66]:
summary_stats = mpg.describe()
print(summary_stats)

       dispacement         year         cyl         cty         hwy
count   234.000000   234.000000  234.000000  234.000000  234.000000
mean      3.471795  2003.500000    5.888889   16.858974   23.440171
std       1.291959     4.509646    1.611534    4.255946    5.954643
min       1.600000  1999.000000    4.000000    9.000000   12.000000
25%       2.400000  1999.000000    4.000000   14.000000   18.000000
50%       3.300000  2003.500000    6.000000   17.000000   24.000000
75%       4.600000  2008.000000    8.000000   19.000000   27.000000
max       7.000000  2008.000000    8.000000   35.000000   44.000000

#### 10.How many different manufacturers are there?

In [68]:
num_manufacturers = mpg['manufacturer'].nunique()
print("Number of different manufacturers:", num_manufacturers)

Number of different manufacturers: 15

In [69]:
# to find the number of different manufacturers in the dataset
#find unique manufacturers
print(pd.Series(pd.unique(mpg['manufacturer'])))

0           audi
1      chevrolet
2          dodge
3           ford
4          honda
5        hyundai
6           jeep
7     land rover
8        lincoln
9        mercury
10        nissan
11       pontiac
12        subaru
13        toyota
14    volkswagen
dtype: object

#### 11.How many different models are there?

In [70]:
num_models = mpg['model'].nunique()
print("Number of different models:", num_models)

Number of different models: 38

In [72]:
# to find the number of different models and the models in the dataset
#find unique models
print(pd.Series(pd.unique(mpg['model'])))

0                         a4
1                 a4 quattro
2                 a6 quattro
3         c1500 suburban 2wd
4                   corvette
5            k1500 tahoe 4wd
6                     malibu
7                caravan 2wd
8          dakota pickup 4wd
9                durango 4wd
10       ram 1500 pickup 4wd
11            expedition 2wd
12              explorer 4wd
13           f150 pickup 4wd
14                   mustang
15                     civic
16                    sonata
17                   tiburon
18        grand cherokee 4wd
19               range rover
20             navigator 2wd
21           mountaineer 4wd
22                    altima
23                    maxima
24            pathfinder 4wd
25                grand prix
26              forester awd
27               impreza awd
28               4runner 4wd
29                     camry
30              camry solara
31                   corolla
32    land cruiser wagon 4wd
33         toyota tacoma 4wd
34                       gti
35                     jetta
36                new beetle
37                    passat
dtype: object

#### 12.Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [73]:
mpg.columns

Index(['manufacturer', 'model', 'dispacement', 'year', 'cyl', 'trans', 'drv',
       'cty', 'hwy', 'fl', 'class'],
      dtype='object')

In [81]:
# Create 'mileage_difference' column
mpg['mileage_difference'] = mpg['hwy'] - mpg['cty']
mpg.head()

,manufacturer,model,dispacement,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

#### 13.Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [82]:
# Create 'average_mileage' column
mpg['average_mileage'] = (mpg['hwy'] + mpg['cty']) / 2
mpg.head()

,manufacturer,model,dispacement,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

### 14.Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [93]:
mpg['is_automatic'] = np.where(mpg['trans'].str.contains('automatic'), True,False)
mpg.head()

,manufacturer,model,dispacement,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,manual,f,18,29,p,compact,11,23.5,False
2,audi,a4,1.8,1999,4,manual,f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual,f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,manual,f,21,30,p,compact,9,25.5,False
5,audi,a4,2.8,1999,6,manual,f,16,26,p,compact,10,21.0,False

In [92]:
#or

mpg['trans'] = mpg['trans'].apply(lambda x: 'automatic' if 'automatic' in x else 'manual')
mpg['is_automatic'] = mpg['trans'] == 'automatic'
mpg.head()

,manufacturer,model,dispacement,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,manual,f,18,29,p,compact,11,23.5,False
2,audi,a4,1.8,1999,4,manual,f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual,f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,manual,f,21,30,p,compact,9,25.5,False
5,audi,a4,2.8,1999,6,manual,f,16,26,p,compact,10,21.0,False

#### 15.Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [94]:
mpg.columns

Index(['manufacturer', 'model', 'dispacement', 'year', 'cyl', 'trans', 'drv',
       'cty', 'hwy', 'fl', 'class', 'mileage_difference', 'average_mileage',
       'is_automatic'],
      dtype='object')

In [95]:
best_manufacturer = mpg.groupby('manufacturer')['average_mileage'].mean().idxmax()
print("Manufacturer with the best average miles per gallon:", best_manufacturer)

Manufacturer with the best average miles per gallon: honda

#### 16.Do automatic or manual cars have better miles per gallon?

In [ ]:
# You can compare the average miles per gallon for automatic and manual cars using a similar approach

In [98]:
avg_mpg_by_trans = mpg.groupby('is_automatic')['average_mileage'].mean()
print("Average miles per gallon for automatic and manual cars:", avg_mpg_by_trans)

Average miles per gallon for automatic and manual cars: is_automatic
False    20.149573
Name: average_mileage, dtype: float64

 ## Exercises III

#### 1 .Use your get_db_url function to help you explore the data from the chipotle database.

In [99]:
chipotle_sql_query = '''
                     SELECT *
                     FROM orders;
                     '''

In [100]:
orders = pd.read_sql(chipotle_sql_query, get_db_url('chipotle'))
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [101]:
orders.shape

(4622, 6)

In [102]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   object
dtypes: int64(3), object(3)
memory usage: 216.8+ KB

#### 2.What is the total price for each order?

In [103]:
orders['item_price'] = orders.item_price.str.replace('$', '').astype(float)
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   float64
dtypes: float64(1), int64(3), object(2)
memory usage: 216.8+ KB

In [104]:
order_totals = orders.groupby('order_id').item_price.sum()

order_totals.sample(5)

order_id
1166     24.45
926     205.25
1621     10.08
1132     18.07
756      18.64
Name: item_price, dtype: float64

#### 3.What are the most popular 3 items?

In [105]:
top_three = orders.groupby('item_name').quantity.sum().sort_values(ascending=False).head(3)
top_three

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

#### 4.Which item has produced the most revenue?

In [106]:
orders.groupby('item_name').item_price.sum().sort_values(ascending=False).head(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

#### 5. Join the employees and titles DataFrames together.

In [107]:
employees_sql_query = '''
                     SELECT *
                     FROM employees;
                     '''

In [108]:
employees = pd.read_sql(employees_sql_query, get_db_url('employees'))
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [110]:
titles_sql_query = '''
                     SELECT *
                     FROM titles;
                     '''

In [111]:

titles = pd.read_sql(titles_sql_query, get_db_url('employees'))
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [112]:
emp_titles=employees.merge(titles, how='left', on='emp_no', indicator=True)
emp_titles.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date,_merge
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01,both
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01,both
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01,both
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01,both
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01,both

#### 6.For each title, find the hire date of the employee that was hired most recently with that title.

In [113]:
newer_titles = pd.read_sql('''SELECT * FROM employees WHERE hire_date <=NOW()''', url)

In [135]:
newer_titles.sort_values('hire_date',ascending=False).head()

        emp_no  birth_date first_name  last_name gender   hire_date
263831  463807  1964-06-12     Bikash     Covnot      M  2000-01-28
228401  428377  1957-05-09      Yucai    Gerlach      M  2000-01-23
299577  499553  1954-05-06   Hideyuki  Delgrande      F  2000-01-22
122989  222965  1959-08-07    Volkmar      Perko      F  2000-01-13
37290    47291  1960-09-09        Ulf     Flexer      M  2000-01-12

#### 7. Write the code necessary to create a cross tabulation of the number of titles by department.
#### (Hint: this will involve a combination of SQL code to pull the necessary data
#### and python/pandas code to perform the manipulations.)

In [125]:
dept_title_query = '''

                    SELECT t.emp_no, 
                    t.title, 
                    t.from_date, 
                    t.to_date, 
                    d.dept_name 
                    FROM departments AS d 
                    JOIN dept_emp AS de USING(dept_no) 
                    JOIN titles AS t USING(emp_no);

                    '''

In [126]:
# reading data from employees database

dept_titles = pd.read_sql(dept_title_query, get_db_url('employees'))

In [131]:
# create a cross tabulation of the number of titles by department

titles_by_dept = pd.crosstab(dept_titles['dept_name'], dept_titles['title'])
print(titles_by_dept)

title               Assistant Engineer  Engineer  Manager  Senior Engineer  \
dept_name
Customer Service                   298      2362        4             2027
Development                       7769     58135        2            49326
Finance                              0         0        2                0
Human Resources                      0         0        2                0
Marketing                            0         0        2                0
Production                        6445     49649        4            42205
Quality Management                1831     13852        4            11864
Research                           378      2986        2             2570
Sales                                0         0        2                0

title               Senior Staff  Staff  Technique Leader
dept_name
Customer Service           13925  16150               309
Development                 1247   1424              7683
Finance                    12139  13929                 0
Human Resources            12274  14342                 0
Marketing                  13940  16196                 0
Production                  1270   1478              6557
Quality Management             0      0              1795
Research                   11637  13495               393
Sales                      36191  41808                 0